In [1]:
# This notebook we will discuss how we combine data using different methods provided by Pandas

# We will discuss of : concat() , join() and merge()

# Join and merge perform almost the same function we will omit one and focus on the other one.

import pandas as pd

In [2]:
# Concat method is used when we are combining data from different dataframes or series and they have the same column names

# We can try and create our own two data frames

# We create a dataframe containing marks of students who passed


marks_1 ={
    'English' : [90 , 70 , 80] ,
    'Passed' : ["Yes", 'Yes' , 'Yes']
}

# Marks of students who failed

marks_2 ={
    'English' : [40 , 30 , 20] ,
    'Passed' : ["No", 'No' , 'No']
}

In [4]:
# We create 2 seperate dataframes for the 2 data

marks_passed_df = pd.DataFrame(marks_1)
marks_passed_df

   English Passed
0       90    Yes
1       70    Yes
2       80    Yes

In [5]:
# 2nd dataframe for the students who failed the exams

marks_failed_df = pd.DataFrame(marks_2)
marks_failed_df

   English Passed
0       40     No
1       30     No
2       20     No

In [6]:
# Since the 2 dataframes have the same columns we can combine the dataframes using the concat method.

pd.concat([marks_passed_df , marks_failed_df])

   English Passed
0       90    Yes
1       70    Yes
2       80    Yes
0       40     No
1       30     No
2       20     No

In [ ]:
# The join method

# The join method looks at the index if they match they are displayed

# key parameter in join is how

# how = left means keep everything from 1st dataframe(left) and match with the other dataframe. if empty it will write null

# how = inner means it only displays the indexes that are in both data frames

In [10]:
# Join on the other hand id for different columns

df_scores = pd.DataFrame({'English_Score': [90, 40]}, index=[1, 2])
df_status = pd.DataFrame({'Passed': ['Yes', 'No']}, index=[1, 2])

In [12]:
joined_results = df_scores.join(df_status)
joined_results

   English_Score Passed
1             90    Yes
2             40     No

In [13]:
# in the above we can also use the parameter inner. we said inner displays everything in df 1 and df2

joined_results = df_scores.join(df_status , how = 'inner')
joined_results

   English_Score Passed
1             90    Yes
2             40     No

In [14]:
# how parameter

# DF with indexes 1 and 2
df_left = pd.DataFrame({'Score': [88, 77]}, index=[1, 2])

# DF with indexes 1 and 3 (Index 2 is missing)
df_right = pd.DataFrame({'Grade': ['A', 'C']}, index=[1, 3])

In [ ]:
# how left
# EVERYTHING FROM 1ST DATAFRAME AND LOOKS FOR SIMILAR INDEXES IN THE OTHER DATAFRAME

results_left = df_left.join(df_right , how = 'left')
results_left

   Score Grade
1     88     A
2     77   NaN

In [ ]:
# how outer
# The outer join keeps all unique indexes from both sides (1, 2, and 3), filling missing values with NaN

In [17]:
results_outer = df_left.join(df_right , how = 'outer')
results_outer

   Score Grade
1   88.0     A
2   77.0   NaN
3    NaN     C